/**
 * @module 此模块封装了项目中可能使用到的枚举常量值
 */


/**
 * 支持的调用后端的指令
 */
export enum Cmds {

  // ------------------------------------------------------------------------------------------------------------------
  // ------------------------------------------------------游戏类------------------------------------------------------
  // ------------------------------------------------------------------------------------------------------------------

  /**
   * 获得用户信息
   */
  GET_USER_INFO = "get_user_info",

  /**
   * 更新用户信息
   */
  UPDATE_USER_INFO = "update_user_info",

  /**
   * 获取单个游戏元数据
   */
  GET_GAME_META = "get_game_meta_by_id",

  /**
   * 获取所有游戏元数据
   */
  GET_GAME_META_LIST = "get_game_meta_list",

  /**
   * 删除单个游戏信息
   */
  DELETE_GAME_BY_ID = "delete_game_by_id",

  /**
   * 删除所有游戏信息
   */
  DELETE_ALL_GAMES = "delete_all_games",

  /**
   * 更新后端游戏信息
   */
  UPDATE_GAME = "update_game",

  /**
   * 添加一个新的游戏到库
   */
  ADD_NEW_GAME = "add_new_game",

  /**
   * 添加批量游戏到库
   */
  ADD_NEW_GAME_LIST = "add_new_game_list",

  /**
   * 启动游戏
   */
  START_GAME = "start_game",

  /**
   * 获取所有游戏会话记录
   */
  GET_SESSIONS = "get_sessions",

  /**
   * 获取指定年份的会话记录
   */
  GET_SESSIONS_BY_YEAR = "get_sessions_by_year",

  // ------------------------------------------------------------------------------------------------------------------
  // ------------------------------------------------------压缩类------------------------------------------------------
  // ------------------------------------------------------------------------------------------------------------------

  /**
   * 获取压缩包内元数据
   */
  GET_ARCHIVE_LIST = "get_archive_list",

  /**
   * 提取压缩包内数据解压到另一个目录
   */
  EXTRACT_ARCHIVE = "extract_archive",

  // ------------------------------------------------------------------------------------------------------------------
  // ------------------------------------------------------配置类------------------------------------------------------
  // ------------------------------------------------------------------------------------------------------------------

  /**
   * 获取配置信息
   */
  GET_CONFIG = "get_config",

  /**
   * 更新配置信息
   */
  UPDATE_CONFIG = "update_config",

  // ------------------------------------------------------------------------------------------------------------------
  // ----------------------------------------------------游戏快照类----------------------------------------------------
  // ------------------------------------------------------------------------------------------------------------------

  /**
   * 获得指定月份的快照
   */
  GET_SCREENSHOTS_BY_YEAR_MONTH = "get_screenshots_by_year_month",

  /**
   * 更新快照感想信息
   */
  UPDATE_SCREENSHOT_BY_ID = "update_screenshot_by_id",

  /**
   * 删除快照
   */
  DELETE_SCREENSHOT_BY_ID = "delete_screenshot_by_id",

  // ------------------------------------------------------------------------------------------------------------------
  // ------------------------------------------------------备份类------------------------------------------------------
  // ------------------------------------------------------------------------------------------------------------------

  /**
   * 备份所有设置了存档路径游戏存档
   */
  BACKUP_ARCHIVE = "backup_archive",

  /**
   * 通过id备份单个游戏
   */
  BACKUP_ARCHIVE_BY_ID = "backup_archive_by_id",

  /**
   * 恢复所有备份数据
   */
  RESTORE_ALL_ARCHIVES = "restore_all_archives",

  /**
   * 恢复指定id的备份游戏存档
   */
  RESTORE_ARCHIVE_BY_ID = "restore_archive_by_id",

  // ------------------------------------------------------------------------------------------------------------------
  // -----------------------------------------------------快捷键类-----------------------------------------------------
  // ------------------------------------------------------------------------------------------------------------------

  /**
   * 获取所有快捷键信息
   */
  GET_SHORTCUTS = "get_shortcuts",

  /**
   * 更新所有快捷键信息
   */
  UPDATE_SHORTCUTS = "update_shortcuts",

  // ------------------------------------------------------------------------------------------------------------------
  // -----------------------------------------------------工具类-----------------------------------------------------
  // ------------------------------------------------------------------------------------------------------------------

  /**
   * 获取游戏启动路径
   */
  GET_START_UP_PATH = "get_start_up_path",

  /**
   * 获取系统的所有字体
   */
  GET_SYSTEM_FONTS = "get_system_fonts",

  /**
   * 获取游戏的存储大小
   */
  GET_GAME_SIZE = "get_game_size",

  /**
   * 获取操作系统上的挂载卷
   */
  GET_DISKS = "get_disks",

  /**
   * 获取指定磁盘的使用率
   */
  GET_DISK_USAGE = "get_disk_usage",

  /**
   * 将指定路径添加到可访问权限
   */
  AUTHORIZE_PATH_ACCESS = "authorize_path_access",

  /**
   * 获取所有的连携程序
   */
  GET_COMPAIONS = "get_companions",

  /**
   * 更新所有的连携程序
   */
  UPDATE_COMPAIONS = "update_companions",

  /**
   * 清理程序的所有数据
   */
  CLEAR_APP_DATA = "clear_app_data",

  /**
   * 获取主题信息
   */
  GET_THEMES = "get_theme",

  /**
   * 获取所有主题的名字
   */
  GET_ALL_THEME_NAMES = "get_all_theme_names"
}
